{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 20, 64, 3], "name": "lambda_1", "function": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\fmodel_kev.py\u00da\b<lambda>\\\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "nb_col": 8, "W_regularizer": null, "nb_filter": 16, "b_regularizer": null, "subsample": [4, 4], "name": "Conv1", "dim_ordering": "tf", "border_mode": "same", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "nb_row": 8, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "nb_col": 5, "W_regularizer": null, "nb_filter": 32, "b_regularizer": null, "subsample": [2, 2], "name": "Conv2", "dim_ordering": "tf", "border_mode": "same", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "nb_col": 5, "W_regularizer": null, "nb_filter": 64, "b_regularizer": null, "subsample": [2, 2], "name": "Conv3", "dim_ordering": "tf", "border_mode": "same", "activation": "relu", "W_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "output_dim": 512, "name": "FC1", "init": "glorot_uniform", "bias": true, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "name": "output", "init": "glorot_uniform", "bias": true, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true}}], "keras_version": "1.0.7"}