{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "BatchNormalization", "config": {"trainable": true, "axis": 1, "name": "batchnormalization_1", "input_dtype": "float32", "batch_input_shape": [null, 20, 64, 3], "epsilon": 1e-06, "momentum": 0.99, "mode": 0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "trainable": true, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "nb_filter": 16, "W_constraint": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "trainable": true, "b_regularizer": null, "subsample": [1, 2], "init": "glorot_uniform", "bias": true, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_row": 2, "activity_regularizer": null, "nb_col": 2, "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "trainable": true, "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_row": 2, "activity_regularizer": null, "nb_col": 2, "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "border_mode": "valid", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 512, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 10, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "trainable": true, "input_dim": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "activation": "linear"}}]}